[{"id":89212,"title":null,"review_text":"What a great course, it was full of useful information and guidance.","course_id":453127,"rating":5,"user_id":8267659,"approved":true,"created_at":"2019-05-17T11:48:24.264Z"},{"id":89921,"title":null,"review_text":"","course_id":453127,"rating":4,"user_id":8935579,"approved":true,"created_at":"2019-05-21T03:42:56.381Z"},{"id":90091,"title":null,"review_text":"Very informative and useful information. It helps boost the ability to start doing voice-overs with ease!","course_id":453127,"rating":5,"user_id":9011935,"approved":true,"created_at":"2019-05-21T23:33:25.267Z"},{"id":90218,"title":null,"review_text":"As a Top Seller,  I was pleasantly surprised how much I still learned from Keith! The exercises, practice scripts, and 5 characters were especially helpful. ","course_id":453127,"rating":5,"user_id":5734198,"approved":true,"created_at":"2019-05-22T17:44:47.572Z"},{"id":90241,"title":"","review_text":"I've been doing VO for a while now but for the price I thought I'd check this out. Pretty amazed at how much information is here, and I learned a thing or two!","course_id":453127,"rating":5,"user_id":8773501,"approved":true,"created_at":"2019-05-22T19:51:18.923Z"},{"id":90399,"title":null,"review_text":"Very thoughtful and thorough.  It covered a lot of topics.  I like that it included recommendations for equipment, exercises and demonstrations for making a demo and working with audio and video.  Keith's voice is great and he is upbeat and engaged.  Nice job!","course_id":453127,"rating":5,"user_id":8803524,"approved":true,"created_at":"2019-05-23T15:05:47.443Z"},{"id":90443,"title":null,"review_text":"Great reminders and tips for voice actors whether we've been in the business for years or just starting out. Thank you for your hard work and clear delivery! Much appreciated.\r\n\r\n- Rene Pierre","course_id":453127,"rating":5,"user_id":8214766,"approved":true,"created_at":"2019-05-23T18:28:38.657Z"},{"id":90540,"title":null,"review_text":"Keith Harris \"Voice Over for Real People: Complete Freelancing Guide\" is an excellent course for those yearning to enter the exciting field of voice overs. I really enjoyed his motivational method to develop skills. A great foundation for beginners and a great refresher as well. Great Job, Keith!","course_id":453127,"rating":5,"user_id":6332200,"approved":true,"created_at":"2019-05-24T07:46:31.634Z"},{"id":90759,"title":null,"review_text":"This course is exactly what I wanted. Keith is great instructor and I would like to hear more from him. I recommend this course to both beginners and professionals. It has great exercises, tips and tricks and a bunch more! Great!","course_id":453127,"rating":5,"user_id":5891333,"approved":true,"created_at":"2019-05-25T14:20:09.414Z"},{"id":90927,"title":null,"review_text":"I have been searching for many different programs all over the internet to help me develop my skills. None have been so helpful as this one. I really appreciated the in depth approach to voice exercises, audio and video editing. I am very glad that I purchased this training session.","course_id":453127,"rating":5,"user_id":6282886,"approved":true,"created_at":"2019-05-26T13:55:27.871Z"},{"id":90938,"title":null,"review_text":"Excellent course that has helped guide me into the world of voice over. It's packed with valuable information and it's well worth the value. Highly recommended!","course_id":453127,"rating":5,"user_id":5691222,"approved":true,"created_at":"2019-05-26T14:47:58.465Z"},{"id":91015,"title":null,"review_text":"","course_id":453127,"rating":5,"user_id":8915948,"approved":true,"created_at":"2019-05-27T00:05:32.141Z"},{"id":91063,"title":null,"review_text":"This course was a wonderful intro to Voice Over. Although I have been on Fiverr for a year, I learned several new points that will help me improve my skills. Thank you for offering a course for VO. The instructor was wonderful and obviously enjoys his job and the teaching aspect of what he does. I would also appreciate a woman instructor and a bit more advanced course for those who wish to continue getting educated. I would pay for it! Thanks again and n ice job! I will ask all the beginners who I encourage, to take this course. Melissa Harlow VO ","course_id":453127,"rating":5,"user_id":8914924,"approved":true,"created_at":"2019-05-27T06:49:42.080Z"},{"id":91610,"title":null,"review_text":"This is an excellent course for beginners in voice over.  I've been working for 2 years already, but there were still plenty of good tips for more experienced vo artists, and great reminders about the basics that are easy to lose sight of after a while.","course_id":453127,"rating":4,"user_id":9186399,"approved":true,"created_at":"2019-05-29T19:48:37.544Z"},{"id":92092,"title":null,"review_text":"","course_id":453127,"rating":3,"user_id":8924961,"approved":true,"created_at":"2019-06-01T17:46:40.682Z"},{"id":92097,"title":null,"review_text":"","course_id":453127,"rating":5,"user_id":8914297,"approved":true,"created_at":"2019-06-01T18:08:05.102Z"},{"id":92632,"title":null,"review_text":"This is great course if you are trying to get into VO. I am fairly new to the VO business and this course taught me alot of knowledge about what is needed and expected as a VO artist.  This course provides a ton of practice scripts and other things...(no spoilers), to help your voice delivery. ","course_id":453127,"rating":5,"user_id":8806112,"approved":true,"created_at":"2019-06-04T22:34:52.505Z"},{"id":93001,"title":null,"review_text":"This class is taught at a good pace with lots of useful information, great for beginning talent, and, for intermediate professionals. Outstanding course! ","course_id":453127,"rating":5,"user_id":8733082,"approved":true,"created_at":"2019-06-06T20:22:48.810Z"},{"id":93274,"title":null,"review_text":"Great course! Super easy to follow and he is super encouraging and positive! Highly recommend!","course_id":453127,"rating":5,"user_id":8949926,"approved":true,"created_at":"2019-06-08T10:39:34.357Z"},{"id":93533,"title":null,"review_text":"This was a great course, enjoyed it and it kept me engaged.  The coach was lively and the sessions were long enough to digest over a few weeks in between my life. ","course_id":453127,"rating":5,"user_id":8684909,"approved":true,"created_at":"2019-06-10T00:20:23.996Z"},{"id":94235,"title":null,"review_text":"","course_id":453127,"rating":4,"user_id":6167397,"approved":true,"created_at":"2019-06-12T23:19:09.990Z"},{"id":95033,"title":null,"review_text":"","course_id":453127,"rating":5,"user_id":8962621,"approved":true,"created_at":"2019-06-16T23:52:50.157Z"},{"id":95085,"title":null,"review_text":"Lots of great information, some common sense &amp; some things I have been wanting to learn. The downloadable extras are especially useful. I expect to be coming back to some parts of this course at least a couple more times. Thank you, Keith!","course_id":453127,"rating":5,"user_id":6431577,"approved":true,"created_at":"2019-06-17T04:01:42.537Z"},{"id":95599,"title":null,"review_text":"The course was interesting and easy to follow.  Keith has a great way of keeping voice over simple, and encouraging one along the way.  The topics and the recording exercise have been a great refresher for me since I graduated from broadcasting school about 3 years ago.  I am working on setting up my first gig on Fiverr, and I look forward to getting started, and building on experience and assets to get a solid place in the industry among the most reputable voices around.","course_id":453127,"rating":5,"user_id":8851272,"approved":true,"created_at":"2019-06-19T14:02:19.014Z"},{"id":96532,"title":null,"review_text":"","course_id":453127,"rating":3,"user_id":9707802,"approved":true,"created_at":"2019-06-25T01:34:36.406Z"},{"id":97894,"title":null,"review_text":"Very thorough, comprehensive and informative! ","course_id":453127,"rating":5,"user_id":6194440,"approved":true,"created_at":"2019-06-30T17:34:54.020Z"},{"id":98296,"title":null,"review_text":"Always good to hear how other voice actors feel about our business. I see things sometimes differently but enjoyed listening to his learning sessions. Would be a nice feature if we could interact with the teachers directly.","course_id":453127,"rating":5,"user_id":6053545,"approved":true,"created_at":"2019-07-02T18:04:27.176Z"},{"id":101021,"title":null,"review_text":"This course had great information! If you are beginner this course is great, if you take this course to get some new tips I know I definitely learned some new things that will help with my gigs! \r\n\r\nDclover1","course_id":453127,"rating":5,"user_id":5744238,"approved":true,"created_at":"2019-07-13T16:21:41.132Z"},{"id":101844,"title":null,"review_text":"","course_id":453127,"rating":5,"user_id":5895066,"approved":true,"created_at":"2019-07-16T17:57:27.529Z"},{"id":102602,"title":null,"review_text":"","course_id":453127,"rating":5,"user_id":10099328,"approved":true,"created_at":"2019-07-19T12:39:29.757Z"},{"id":103919,"title":null,"review_text":"Outstanding experience! I enjoyed it.","course_id":453127,"rating":5,"user_id":5662067,"approved":true,"created_at":"2019-07-23T13:15:10.767Z"},{"id":109135,"title":null,"review_text":"","course_id":453127,"rating":5,"user_id":6185286,"approved":true,"created_at":"2019-08-13T02:43:22.870Z"},{"id":112939,"title":null,"review_text":"Wow what a thorough and excellent course, I highly recommend this.","course_id":453127,"rating":5,"user_id":8935686,"approved":true,"created_at":"2019-08-26T17:17:22.225Z"},{"id":112962,"title":null,"review_text":"","course_id":453127,"rating":5,"user_id":8376025,"approved":true,"created_at":"2019-08-26T19:11:06.875Z"},{"id":113155,"title":null,"review_text":"Great course and a great tool set for getting started in voice over. \r\nOne thing I found bothersome was the sound mixing. Any time a demo or separate video was played, it was so much louder than his speaking to the camera. It was even worse when he was speaking about balancing audio, and yet the audio was not balanced.","course_id":453127,"rating":5,"user_id":5737443,"approved":true,"created_at":"2019-08-27T12:52:46.466Z"},{"id":113426,"title":null,"review_text":"Excellent job on putting together the course. I think this is great for anyone new to Fiverr and new to voice over. Keith is a very well spoken instructor and it is easy to follow along. We would highly recommend this course to others!\r\n\r\nMatt and Allie\r\nWolfcreek Audio","course_id":453127,"rating":5,"user_id":10503649,"approved":true,"created_at":"2019-08-28T10:24:14.629Z"},{"id":113664,"title":null,"review_text":"Love it! Very informative and well put together!","course_id":453127,"rating":5,"user_id":5662538,"approved":true,"created_at":"2019-08-28T23:50:13.817Z"},{"id":113810,"title":null,"review_text":"Keith has really helped me to improve my skillset - even though I've been freelancing as a voiceover artist for the past 5 years. It's a great, high quality and beginner friendly course :)","course_id":453127,"rating":5,"user_id":5693796,"approved":true,"created_at":"2019-08-29T12:15:04.904Z"},{"id":114030,"title":null,"review_text":"","course_id":453127,"rating":5,"user_id":6450975,"approved":true,"created_at":"2019-08-30T05:26:25.718Z"},{"id":114112,"title":null,"review_text":"Keith's approach is very detailed and thorough. Helpful info for beginners in VO and established VO artists as well. Well done!","course_id":453127,"rating":5,"user_id":9658924,"approved":true,"created_at":"2019-08-30T14:57:08.436Z"},{"id":114929,"title":null,"review_text":"I really enjoyed this course and found Keith to be an outstanding instructor. I started in VoiceOver in 2015 with a reputable company and I felt as though I received good training. Then I began to realize that I didn't know much about all the technical aspects of this business and it became very stressful and frustrating because nobody wanted to help me unless I was willing to spend big money to learn from them and they only taught a few things and recommended that I go find answers needed through google or youtube. I don't want to bad mouth the company that I got my start from because I feel that it would be disrespectful and there were some people that I worked with there that were great people to work with. I just didn't get all of the training that I now see that I should have gotten to be better prepared as a voice artist. This session with Keith has made me feel like I made the right decision to become a voice artist and I plan to keep working with Keith if he will have me because I can truly say that I now feel more empowered to step out and give myself and this business more of an opportunity to grow and help those that are coming to Fiverr to help them with their projects. I also plan to continue to work with Keith on building my skills and knowledge about VoiceOver and Fiverr. Sadly to say, I've learned more with Keith in this session than I learned in the 10-month program I was in with the other company. Thank you Keith, and thank you Fiverr for making it possible to have such a great experience with this course and instructor. ","course_id":453127,"rating":5,"user_id":7750075,"approved":true,"created_at":"2019-09-03T01:45:15.617Z"},{"id":115414,"title":null,"review_text":"This was a great starting point for the beginner.  I found the material high quality (one small type-o.  ","course_id":453127,"rating":5,"user_id":11093117,"approved":true,"created_at":"2019-09-04T20:44:14.698Z"},{"id":116065,"title":null,"review_text":"This was a well-rounded course on Voice over actingas a true home business.","course_id":453127,"rating":5,"user_id":11180223,"approved":true,"created_at":"2019-09-07T09:47:40.317Z"},{"id":116722,"title":null,"review_text":"Excellent content. I wish the quizzes were a little more challenging (i.e.: the true/false questions always have the correct answer in lowercase and the incorrect answer in UPPERCASE). Also, there were a couple of typos in the \"Quiz: Home Studio\" section. Question 3 spells XRL mic, instead of the correct XLR mic. Question 4 spells \"booth\" as \"both.\"\r\n\r\nOther than the minor issues above, I feel much better equipped to start my voice over work on Fiverr.","course_id":453127,"rating":5,"user_id":11080289,"approved":true,"created_at":"2019-09-09T20:13:26.097Z"},{"id":119452,"title":null,"review_text":"LOVED IT!! SO HELPFUL!","course_id":453127,"rating":5,"user_id":11203138,"approved":true,"created_at":"2019-09-18T22:20:28.719Z"},{"id":119603,"title":null,"review_text":"Excellent course from a very knowledgeable voice-over artist! As an established voice-over talent myself I still learned a ton of new things to help me grove my career and perform better in the future. I liked very much that Keith also offered voice training excercises, which is a key element in succeding in voice. Thank you very much! ","course_id":453127,"rating":5,"user_id":11195537,"approved":true,"created_at":"2019-09-19T12:56:15.160Z"},{"id":120134,"title":null,"review_text":"","course_id":453127,"rating":5,"user_id":8961593,"approved":true,"created_at":"2019-09-21T17:00:09.896Z"},{"id":123703,"title":null,"review_text":"Keith did a great job with information.  He does mug a bit too much for the camera.  Clearly needs some on-camera coaching.  And the audio levels were all over the place.  When he was on camera, the levels were fine, but when transitioned to one of his demo reels, for examply, the audio was 80% LOUDER.  The video needs some audio finetuning, but Keith really did provide some great info.","course_id":453127,"rating":3,"user_id":11157284,"approved":true,"created_at":"2019-10-04T00:19:15.107Z"},{"id":123895,"title":null,"review_text":"The course itself, and the material, are of excellent quality. The teacher, Keith, is positive, upbeat, and friendly, and he is absolutely a great presenter of knowledge. The course was well worth the money, even for a seasoned VO like myself. I've been working in the industry for many years, and allthough much of the material was about getting started in the industry, the insights were interesting. \r\n\r\nThe only note on dissatisfaction for me with this course, is the fact that Keith recommends USB microphones like the Blue Yeti to new talent. I think this is setting the bar too low if you're getting paid to do voice-over work. \r\n\r\nOn the acting, warm-ups etc. Keith is spot on all the way, and I was happy to learn some new and fun ways of working on my own vocal health, as well as new ways to organize my files, and work schedules.\r\n\r\nThis course will probably not add a lot to what seasoned voice-over talent knows already, but it was inspiring, fun to do, and had some good insights. I would absolutely recommend this to anyone getting started in voice-over, and even to long-timers who are looking for some inspiration and tips &amp; tricks along the way. \r\n\r\nI would love to see more courses on voice-over from Keith in the future, perhaps with content for the already established talent out there as well. \r\n\r\nAll in all - well worth the money and time!\r\n\r\n","course_id":453127,"rating":5,"user_id":6003184,"approved":true,"created_at":"2019-10-04T21:01:40.342Z"},{"id":127634,"title":null,"review_text":"Does not worth the money maybe 20 box is a reasonable price.","course_id":453127,"rating":1,"user_id":6596568,"approved":true,"created_at":"2019-10-19T18:13:04.827Z"},{"id":130524,"title":null,"review_text":"Outstanding! Brilliant for beginners and also professionals. I have been a voice over artist for over 3 years and still was surprised by the amount of knowledge I got from this course. Definitely recommended!","course_id":453127,"rating":5,"user_id":6747877,"approved":true,"created_at":"2019-10-29T05:43:37.716Z"},{"id":132810,"title":null,"review_text":"","course_id":453127,"rating":5,"user_id":11086196,"approved":true,"created_at":"2019-11-05T17:25:41.552Z"},{"id":133480,"title":null,"review_text":"Thorough and quite useful. I highly recommend this course to anyone starting out in voice over.","course_id":453127,"rating":5,"user_id":9549552,"approved":true,"created_at":"2019-11-07T18:47:47.524Z"},{"id":133827,"title":null,"review_text":"Wow what a game changer. I'm very happy that I took this course. It really helped me to understand what it takes to make it as a voiceover artist not only in Fiverr, but beyond that. I actually feel like I have the upperhand entering into a new journey and industry. Thank you Keith!","course_id":453127,"rating":5,"user_id":12619489,"approved":true,"created_at":"2019-11-09T01:59:11.062Z"},{"id":139553,"title":null,"review_text":"It was an amazing insight into voice over, and I really enjoyed it.\r\n I will watch it over and over. It was very well presented and made","course_id":453127,"rating":5,"user_id":8820728,"approved":true,"created_at":"2019-12-01T23:27:45.874Z"},{"id":139992,"title":null,"review_text":"useful, learnt a lot","course_id":453127,"rating":5,"user_id":9680522,"approved":true,"created_at":"2019-12-03T10:07:32.538Z"},{"id":140345,"title":null,"review_text":"","course_id":453127,"rating":5,"user_id":13336675,"approved":true,"created_at":"2019-12-04T18:02:22.423Z"},{"id":140677,"title":null,"review_text":"I thought the course was excellent.  I've taken many courses already as well as coaching and schooling, but Keith shared a lot of very helpful tips across the board, making this a definite recommendation for any new or newer voice talent.","course_id":453127,"rating":5,"user_id":13462521,"approved":true,"created_at":"2019-12-05T21:32:56.636Z"},{"id":140921,"title":null,"review_text":"Good course, but wish it were more focused on how to speak and record and not how to stay healthy by drinking water and sleeping 8 hours a day.  Also, Keith should be available to at least answer questions by email.  I feel I got my money's worth however by reviewing the lessons I need.","course_id":453127,"rating":5,"user_id":5750955,"approved":true,"created_at":"2019-12-06T23:09:22.113Z"},{"id":141555,"title":null,"review_text":"Very beneficial information for beginners. Ive done voice over for a while a learned a lot of this info my self so i was looking for more help with the creating a demo and self employment part but in totality the course was great","course_id":453127,"rating":4,"user_id":9598562,"approved":true,"created_at":"2019-12-09T20:53:40.226Z"},{"id":142319,"title":null,"review_text":"Great information!!! Some stuff and knew and some stuff I didn't. Worth the buy for sure though","course_id":453127,"rating":5,"user_id":5745192,"approved":true,"created_at":"2019-12-12T20:12:25.572Z"},{"id":142617,"title":null,"review_text":"I took this course to help improve my Fiverr seller experience. This course is very well done and has something for every voiceover experience level. ","course_id":453127,"rating":5,"user_id":5828768,"approved":true,"created_at":"2019-12-13T23:28:55.158Z"},{"id":143066,"title":null,"review_text":"very informative","course_id":453127,"rating":5,"user_id":13675235,"approved":true,"created_at":"2019-12-16T02:36:45.667Z"},{"id":143506,"title":null,"review_text":"I've been a voice over talent for over 6 years and I still found some new things to learn, excercises to practice every day, how to manage my own gigs/business and interesting tips. Keith did an amazing job with this course.","course_id":453127,"rating":5,"user_id":8975196,"approved":true,"created_at":"2019-12-17T23:58:33.430Z"},{"id":145626,"title":null,"review_text":"Pretty basic information. It didn't really help me to improve my voicoever business. On top of that, I didn't care for the instructor and thought his voice was very rigid. It was honestly harder and harder to listen to him as the course went on.","course_id":453127,"rating":2,"user_id":14181591,"approved":true,"created_at":"2019-12-27T02:17:27.198Z"},{"id":146041,"title":null,"review_text":"The perfect course for people like me that are just starting out.\r\nThere is a lot of value and I haven't found something comparable on the Internet.","course_id":453127,"rating":5,"user_id":7967888,"approved":true,"created_at":"2019-12-28T19:14:28.176Z"},{"id":146042,"title":null,"review_text":"This was great.  I have been in voice-over for 9 years and I picked up a few things that were helpful.  I think the information about being engaged in Fiverr forum was the most helpful.  I enjoy working on Fiverr and believe this information will help me!","course_id":453127,"rating":5,"user_id":13195450,"approved":true,"created_at":"2019-12-28T19:16:08.227Z"},{"id":146227,"title":null,"review_text":"Very helpful with the basics of learning voice over!","course_id":453127,"rating":5,"user_id":14218133,"approved":true,"created_at":"2019-12-29T15:14:48.937Z"},{"id":146389,"title":null,"review_text":"","course_id":453127,"rating":5,"user_id":7919637,"approved":true,"created_at":"2019-12-30T02:12:46.416Z"},{"id":146628,"title":null,"review_text":"","course_id":453127,"rating":1,"user_id":11874156,"approved":true,"created_at":"2019-12-30T21:51:57.121Z"},{"id":147207,"title":null,"review_text":"Excellent instruction in the many facets of the voice over business! Thanks, Keith!","course_id":453127,"rating":5,"user_id":10393573,"approved":true,"created_at":"2020-01-02T04:50:21.418Z"},{"id":147600,"title":null,"review_text":"Although a not-insignificant cost, there are tips here which are specific to the platform and also about doing voice work as an additional income and even while you are travelling around. I know from doing sound technology in my day job that this course covers everything you need to know. I actually purchased this course to see what the competition was like, hoping to set up my own course but... what can I say? It's impressive and covers pretty much everything you'd want to know. Yes you can do other courses but anything beyond this one will see diminishing returns. I can literally only pick holes in the price but his advice on microphones alone could save you that amount!","course_id":453127,"rating":4,"user_id":14077726,"approved":true,"created_at":"2020-01-03T16:00:34.906Z"},{"id":147708,"title":null,"review_text":"Keith offers great instruction for voice over beginners, as well as helpful information working pros can benefit from! Highly recommended.","course_id":453127,"rating":5,"user_id":12128960,"approved":true,"created_at":"2020-01-03T22:49:32.421Z"},{"id":147729,"title":null,"review_text":"Excellent course!  Thank you.","course_id":453127,"rating":5,"user_id":8369388,"approved":true,"created_at":"2020-01-04T01:38:35.594Z"},{"id":147774,"title":null,"review_text":"Fantastic course!  I made a ton of notes and learnt a ton!  Thanks!","course_id":453127,"rating":5,"user_id":6046289,"approved":true,"created_at":"2020-01-04T08:46:58.325Z"},{"id":147817,"title":null,"review_text":"Very informative, and highly recommended, even for current voice over artists... there's a lot of great information in here :)","course_id":453127,"rating":5,"user_id":6320303,"approved":true,"created_at":"2020-01-04T13:25:08.461Z"},{"id":147838,"title":null,"review_text":"","course_id":453127,"rating":5,"user_id":12155645,"approved":true,"created_at":"2020-01-04T15:37:57.532Z"},{"id":147958,"title":null,"review_text":"Keith is a great coach and very good mentor for the level for me to work toward achieving, with my new voice acting career. Thank you I will review this informative often over the next year. Ronnie Jack","course_id":453127,"rating":5,"user_id":14202357,"approved":true,"created_at":"2020-01-04T22:30:40.918Z"},{"id":148060,"title":null,"review_text":"I love Keith! Great coach, great information, lots I didn't know! :) Thank so much. Starting in VO? This course is for you!!","course_id":453127,"rating":5,"user_id":5868714,"approved":true,"created_at":"2020-01-05T11:41:39.891Z"},{"id":149107,"title":null,"review_text":"I've been doing voicework for over 30 years and still picked up some nice tips from this course.  Very realistic and applicable to any skill level.","course_id":453127,"rating":5,"user_id":10211660,"approved":true,"created_at":"2020-01-08T22:39:53.582Z"},{"id":149497,"title":null,"review_text":"Quite boring, actually. Keith has some good information but the tone of his delivery seems aimed at children. I didn’t feel inspired.","course_id":453127,"rating":2,"user_id":9513006,"approved":true,"created_at":"2020-01-10T05:38:23.965Z"},{"id":149621,"title":null,"review_text":"","course_id":453127,"rating":5,"user_id":6365137,"approved":true,"created_at":"2020-01-10T18:01:57.708Z"},{"id":149906,"title":null,"review_text":"","course_id":453127,"rating":5,"user_id":6641277,"approved":true,"created_at":"2020-01-11T22:36:03.168Z"},{"id":150964,"title":null,"review_text":"Good course for absolute beginners, less so if one is already up &amp; running...","course_id":453127,"rating":4,"user_id":9785645,"approved":true,"created_at":"2020-01-15T08:58:25.448Z"},{"id":151150,"title":null,"review_text":"","course_id":453127,"rating":5,"user_id":14312020,"approved":true,"created_at":"2020-01-15T18:43:55.736Z"},{"id":151760,"title":null,"review_text":"","course_id":453127,"rating":5,"user_id":14528140,"approved":true,"created_at":"2020-01-17T14:20:29.503Z"},{"id":153048,"title":null,"review_text":"Great content!","course_id":453127,"rating":5,"user_id":12609458,"approved":true,"created_at":"2020-01-21T04:45:25.706Z"},{"id":153513,"title":null,"review_text":"","course_id":453127,"rating":5,"user_id":14643148,"approved":true,"created_at":"2020-01-22T16:30:06.454Z"},{"id":155308,"title":null,"review_text":"","course_id":453127,"rating":5,"user_id":15095465,"approved":true,"created_at":"2020-01-28T17:58:03.773Z"},{"id":156034,"title":null,"review_text":"This course was very comprehensive and well done.  I am glad I completed it and will go back to it often.","course_id":453127,"rating":5,"user_id":14754756,"approved":true,"created_at":"2020-01-30T03:49:46.778Z"},{"id":156365,"title":null,"review_text":"Why isn't this shown as completed on my gig? I have commented on this several days ago already! ","course_id":453127,"rating":5,"user_id":14405034,"approved":true,"created_at":"2020-01-30T22:13:59.166Z"},{"id":159422,"title":null,"review_text":"Loads of good information. Well worth the investment.","course_id":453127,"rating":5,"user_id":7873484,"approved":true,"created_at":"2020-02-07T15:49:28.124Z"},{"id":163796,"title":null,"review_text":"Excellent and helpful course! Perfect for anyone new to voice over work or new to the Fiverr platform. Covers everything you need to know to get started in the business and to keep yourself motivated and healthy. Thanks for this course Keith!","course_id":453127,"rating":5,"user_id":15718569,"approved":true,"created_at":"2020-02-17T21:31:44.508Z"},{"id":164073,"title":null,"review_text":"Keith seems like a nice guy. And someone I wouldn't mind sitting down and having coffee with. However, this course didn't teach me anything. I have been doing voice over for 12 years and didn't learn anything from this course. In fact, the only reason I payed money (to which I hope to get back) on this was so I could get more views on Fiverr. A new rule of theirs I am not super happy with. This would be okay as a service if there were more options as far as professional voice over talent to learn from. It would also be nice to not make other professional talent have to watch video after video on the most basic content just so there gigs don't always end up at the bottom of the list. Again, nothing wrong with Keith. His target student is someone who has never held a mic before and that's fine. The issue is more the Fiverr \"credentials\" system it'self.","course_id":453127,"rating":1,"user_id":5692442,"approved":true,"created_at":"2020-02-18T12:56:17.133Z"},{"id":164466,"title":null,"review_text":"This course offers exactly what an aspiring voice over talent needs. Keith provides a friendly face and voice to guide you through getting set up and on your way. Keith offers some really practical advice and suggestions so you can feel good about your decision to get into this business and to keep going. Well worth the money.","course_id":453127,"rating":5,"user_id":15078301,"approved":true,"created_at":"2020-02-19T12:22:28.591Z"},{"id":164553,"title":null,"review_text":"I learned a lot form this course - Very well done and definitely worth the investment! ","course_id":453127,"rating":5,"user_id":15455543,"approved":true,"created_at":"2020-02-19T17:42:21.183Z"},{"id":164851,"title":null,"review_text":"Keith does a great job at explaining the concepts in a simple manner and organizes everything very clearly for the learner. Greatly enjoyed the tips and tricks provided! The course has even inspired some fresh ideas of my own to help my business succeed with less clutter and more clarity for my clients. Good material!","course_id":453127,"rating":5,"user_id":5679463,"approved":true,"created_at":"2020-02-20T11:53:10.969Z"},{"id":170955,"title":null,"review_text":"I so appreciate this course! Sometimes you think you know stuff and these courses remind you of their worth. I really enjoyed learning from Keith. I’m looking forward to taking more Fiverr courses really soon - thank you Fiverr!","course_id":453127,"rating":5,"user_id":9595037,"approved":true,"created_at":"2020-03-07T13:29:32.517Z"},{"id":171549,"title":null,"review_text":"Thought that this had a lot of good information for the basics of voice over. I would like to have seen it more tailored to Fiverr. Like how to make gigs and be more effective specifically on the site. I did find a ton of helpful information though that I will use to propel my new career. ","course_id":453127,"rating":5,"user_id":14625074,"approved":true,"created_at":"2020-03-09T05:48:27.387Z"},{"id":175264,"title":null,"review_text":"The course offered some valuable information and some not so valuable information. The information on technique was fantastic. I would have liked to have seen more on how to set up my gig(s). Less on staying motivated and being self-employed. I've been self-employed for nearly 20 years. That should be another course.","course_id":453127,"rating":4,"user_id":16189453,"approved":true,"created_at":"2020-03-17T20:12:26.486Z"},{"id":181057,"title":null,"review_text":"Excellent structure and organization with practical tips for anyone wanting to start a new voice talent business. ","course_id":453127,"rating":5,"user_id":17083647,"approved":true,"created_at":"2020-03-25T18:35:50.503Z"},{"id":181230,"title":null,"review_text":"I've gained a lot of useful information from this course.","course_id":453127,"rating":5,"user_id":16347790,"approved":true,"created_at":"2020-03-25T21:09:57.581Z"},{"id":185136,"title":null,"review_text":"","course_id":453127,"rating":5,"user_id":17430378,"approved":true,"created_at":"2020-03-29T18:00:33.308Z"},{"id":185307,"title":null,"review_text":"","course_id":453127,"rating":5,"user_id":16798786,"approved":true,"created_at":"2020-03-29T20:32:11.937Z"},{"id":186738,"title":null,"review_text":"This class will give the rookie the playbook they need to become a pro.","course_id":453127,"rating":5,"user_id":16977207,"approved":true,"created_at":"2020-03-30T21:50:57.718Z"},{"id":188338,"title":null,"review_text":"Excellent course, well structured and really informative to have a good base on voice over!","course_id":453127,"rating":5,"user_id":12919603,"approved":true,"created_at":"2020-04-01T03:48:47.699Z"},{"id":190316,"title":null,"review_text":"Honestly, there's not much I didn't already know about.  The only stuff I thought was useful was the business side of it (how to organize all files, setting hours, etc.)","course_id":453127,"rating":3,"user_id":14738979,"approved":true,"created_at":"2020-04-02T16:39:46.304Z"},{"id":192524,"title":null,"review_text":"This course is a great introduction to what the voice over industry has in store! Keith gave great advice, tips and help in paving the way to a professional voice career. Would definitely recommend this course for beginners who are looking to take the plunge into the world of freelance voice work!","course_id":453127,"rating":5,"user_id":16808912,"approved":true,"created_at":"2020-04-03T23:47:57.584Z"},{"id":192622,"title":null,"review_text":"A complete, deep yet simple and practical voice-over course with effective technical advices on every single aspect of voice-over business! Keith is way friendly, and an excellent communicator and teacher. I've been in the voice-over business for the last 3 years (and a half), so I already knew a lot, but... Keith kept surprising me with unexpected tips! Highly recommended to anyone who is curious about voice-over business and wants to start their own.","course_id":453127,"rating":5,"user_id":13259251,"approved":true,"created_at":"2020-04-04T02:38:34.770Z"},{"id":194880,"title":null,"review_text":"I really enjoyed this course. I’ve been doing voiceovers for about three or four months now and as a beginner I thought I pretty much had the basic foundation of just starting, but after taking this course I have learned so many helpful tips that I’m going to implement in my voiceover business. Every single piece to this course is valuable information. This is everything that you need to know for a beginner.  I especially enjoy the vocal health as well as the exercises for my voice and most of all how to organize my files. Keith gives a great presentation to each lesson and he doesn’t make it boring he keeps it interesting and that’s a big plus for me...his enthusiasm made me excited to go  to the next lesson.  Was worth every penny I spent.","course_id":453127,"rating":5,"user_id":15721885,"approved":true,"created_at":"2020-04-05T23:54:23.894Z"},{"id":196188,"title":null,"review_text":"I thoroughly enjoyed this course. Keith has a great instructional style and offers information for every skill level. This course is an absolute must for anybody just starting out. Even if you are an experienced professional, Keith's course will remind you of some basics and perhaps teach you a new way to do something. ","course_id":453127,"rating":5,"user_id":18481874,"approved":true,"created_at":"2020-04-06T21:12:20.127Z"},{"id":199055,"title":null,"review_text":"I've been doing voice over for a long time, and have worked with many clients by now.  So I wasn't sure how much I'd get out of this course.  But I must say it was and excellent course and a great reminder that no matter how much experience you have, it's always great to keep learning!  I'm more motivated than ever to continue building my VO biz here on fiverr! ","course_id":453127,"rating":5,"user_id":5662143,"approved":true,"created_at":"2020-04-08T23:59:06.183Z"},{"id":200406,"title":null,"review_text":"Well composed, informative, covers all bases and exceeds expectation regarding the depth of stepping into a new industry. Cheers","course_id":453127,"rating":5,"user_id":10987678,"approved":true,"created_at":"2020-04-10T01:29:29.190Z"},{"id":201221,"title":null,"review_text":"The best $97 I've spent and it's my first full experience of a course on Fiverr.  The instructor does a great job of going step by step.  He offers a lot of in-depth things that I know I will be returning to often, especially as I get my voiceover business off the ground.  I read one 5 star review from a woman who is already a voiceover professional, and she said that this is a great course for those just starting out in voiceover.  She is correct!  He answers the little nagging questions that are in your head as he goes along, and he does a great job of debunking myths.  In the end, I really feel like I can do this, because this has been a desire of mine for a long time!  I would recommend this course to anyone who is serious about getting into the world of voicever. ","course_id":453127,"rating":5,"user_id":15154091,"approved":true,"created_at":"2020-04-10T16:02:19.565Z"},{"id":207584,"title":null,"review_text":"","course_id":453127,"rating":4,"user_id":10360213,"approved":true,"created_at":"2020-04-15T02:32:41.308Z"},{"id":209784,"title":null,"review_text":"a great starting point for beginners very thoroughly covers the fundamentals ","course_id":453127,"rating":5,"user_id":19368912,"approved":true,"created_at":"2020-04-16T15:07:06.329Z"},{"id":215756,"title":null,"review_text":"Great information!","course_id":453127,"rating":5,"user_id":14898181,"approved":true,"created_at":"2020-04-20T19:40:53.787Z"},{"id":216959,"title":null,"review_text":"Very helpful. Has some great basics and covers some very important topics while being self employed in the voicework business.","course_id":453127,"rating":5,"user_id":5986630,"approved":true,"created_at":"2020-04-21T16:19:12.669Z"},{"id":220437,"title":null,"review_text":"","course_id":453127,"rating":4,"user_id":19624625,"approved":true,"created_at":"2020-04-23T21:48:32.129Z"},{"id":223472,"title":null,"review_text":"","course_id":453127,"rating":5,"user_id":20460622,"approved":true,"created_at":"2020-04-26T09:31:32.895Z"},{"id":227168,"title":null,"review_text":"Very informative. I would highly recommend.","course_id":453127,"rating":5,"user_id":12280799,"approved":true,"created_at":"2020-04-28T18:49:09.273Z"},{"id":244597,"title":null,"review_text":"An excellent course for beginners. Contains valuable information for a lot of aspects of voice-over not commonly covered online.","course_id":453127,"rating":4,"user_id":5702511,"approved":true,"created_at":"2020-05-09T18:25:13.199Z"},{"id":248015,"title":null,"review_text":"I was in radio several years ago, so I already knew some of the tricks of the trade, but Keith's course provided a good refresher, as well as showed a few new tricks for this old dog to learn.","course_id":453127,"rating":4,"user_id":17671899,"approved":true,"created_at":"2020-05-11T18:20:40.976Z"},{"id":250601,"title":null,"review_text":"I learned a lot and I’m excited to start my new career!","course_id":453127,"rating":5,"user_id":21668674,"approved":true,"created_at":"2020-05-12T23:54:19.738Z"},{"id":255837,"title":null,"review_text":"This course was exactly what I needed. It answered all of my questions that not even YouTube could answer.","course_id":453127,"rating":5,"user_id":15954967,"approved":true,"created_at":"2020-05-15T20:39:41.984Z"},{"id":269308,"title":null,"review_text":"One of the best ever courses I took on Fiverr. I had a very tight budget and It was difficult to take this course due to financial constraints. However, I am really happy at the end of this course. The amount spent on this course is not an expense, it is an investment! Worth it!   ","course_id":453127,"rating":5,"user_id":5689423,"approved":true,"created_at":"2020-05-24T14:36:04.181Z"},{"id":269954,"title":null,"review_text":"This was a fantastic course...well done Keith Harris.  I enjoyed every aspect of the course and at the same time it was a great learning experience.  Thank you!","course_id":453127,"rating":5,"user_id":10087872,"approved":true,"created_at":"2020-05-24T22:53:39.223Z"},{"id":275478,"title":null,"review_text":"Good course overall but I wish that he went over the different ways to actually get Voice Over work besides using Fiverr.","course_id":453127,"rating":4,"user_id":12128866,"approved":true,"created_at":"2020-05-28T15:48:30.657Z"},{"id":281684,"title":null,"review_text":"Great overall course. Very informative if you're new to the world of voice over. While most of the material is aimed towards the novice, there's good reminders throughout as well as helpful tips and tricks for everyone. Overall, good course.","course_id":453127,"rating":4,"user_id":11380719,"approved":true,"created_at":"2020-06-02T02:51:32.469Z"},{"id":282710,"title":null,"review_text":"Keith was great! As a new Voice Over talent, I learned a great deal from his course and was sure to take plenty of notes. The piece on Organization was hugely beneficial as well as the piece on designing your demo with the 5 characters in mind. I know I'll be going back to these videos several times as well as the exercises. Thanks Keith!","course_id":453127,"rating":5,"user_id":15813800,"approved":true,"created_at":"2020-06-02T19:03:36.869Z"},{"id":284647,"title":null,"review_text":"Excellent course that was extremely thorough in covering all aspects of getting into the voice over business!  Very good, clear instruction taught by someone who is clearly successful in voice over and brings lots of excitement and motivation to aspiring new voice over artists!","course_id":453127,"rating":5,"user_id":13248871,"approved":true,"created_at":"2020-06-04T03:15:09.905Z"},{"id":293062,"title":null,"review_text":"","course_id":453127,"rating":5,"user_id":23949815,"approved":true,"created_at":"2020-06-10T15:20:32.671Z"},{"id":295070,"title":null,"review_text":"Excellent course. I learned much more than I did in my voiceover coaching sessions that I can definitely utilize in my voiceover business. I loved being shown how to place video and music to my voiceover. Thank you for the much needed information. ","course_id":453127,"rating":5,"user_id":21954950,"approved":true,"created_at":"2020-06-12T05:23:30.631Z"},{"id":301549,"title":null,"review_text":"Great course lots of info and put into sections very well ","course_id":453127,"rating":5,"user_id":21840140,"approved":true,"created_at":"2020-06-17T15:50:03.397Z"},{"id":304063,"title":null,"review_text":"","course_id":453127,"rating":4,"user_id":23895107,"approved":true,"created_at":"2020-06-19T17:33:21.207Z"},{"id":306693,"title":null,"review_text":"","course_id":453127,"rating":5,"user_id":24756907,"approved":true,"created_at":"2020-06-22T04:56:54.795Z"},{"id":309048,"title":null,"review_text":"Very informative and educational. Well rounded course on helping one be a better freelancer and voice over Artist. ","course_id":453127,"rating":5,"user_id":9039593,"approved":true,"created_at":"2020-06-23T23:50:49.686Z"},{"id":318739,"title":null,"review_text":"","course_id":453127,"rating":5,"user_id":15912730,"approved":true,"created_at":"2020-07-02T20:50:49.872Z"},{"id":330075,"title":null,"review_text":"I found this to be a good course overall for a beginner. This is not the only course I have taken and I found that this course definitely offered some good tips. I also enjoyed the style in which it was presented. I would recommend  it to others","course_id":453127,"rating":4,"user_id":23908740,"approved":true,"created_at":"2020-07-12T17:11:43.732Z"},{"id":333078,"title":null,"review_text":"Thank you Keith and the Fiverr Team for this awesome course! It was very informative, detailed, and guides the newbie into the steps needed to be a successful Voice Over Artist. Just as the name of the course implies: VO for REAL PEOPLE! He is very real, practical and makes you feel very comfortable that you can really do this! I so appreciate that and the interactive, animated sessions. He did not make it boring AT ALL!!!! Keith, you are truly a Pro and to see where you began and have reached today is an inspiration to anyone starting in this business. Thank You once again for your honesty and shared knowledge! \r\n","course_id":453127,"rating":5,"user_id":25702760,"approved":true,"created_at":"2020-07-14T23:43:39.792Z"},{"id":334166,"title":null,"review_text":"Excellent stuff. I've been working with Fiverr for over a year and wish that I had taken this course a lot sooner. It really helped to clarify my mind on many things and got me thinking about new directions. The voice exercises are Fab!","course_id":453127,"rating":5,"user_id":25644083,"approved":true,"created_at":"2020-07-15T20:31:31.360Z"},{"id":334355,"title":null,"review_text":"I didn't really need to take this class but that's ok. He was spot on about most everything.  I did pick up a few tidbits here and there. The only thing that I believed he mentioned (I listened to it twice) was that we shouldn't record our demo using an existing commercial unless we have received permission.  We don't make money from our demos therefore we are protected by fair use laws and we are able to make such a demo.  \r\n\r\nThe only thing I would suggest is to remaster this project.  The audio levels are all over the board.  \r\n\r\nNow for the awesome stuff.  I wish this would have been the first thing that I would have seen in order to learn the voiceover business. I've spent a ton of money trying to learn how to get started and things would have been a lot easier on my pocketbook if I would have started here first.  This class is well worth the listed price of $94 for any beginner.  Every aspect of the voiceover business is mentioned.  Great job!","course_id":453127,"rating":5,"user_id":26173886,"approved":true,"created_at":"2020-07-16T01:01:00.944Z"},{"id":336249,"title":null,"review_text":"This voice over course is the real deal. Thanks again. J. Salas (SalasMedia)","course_id":453127,"rating":5,"user_id":22886577,"approved":true,"created_at":"2020-07-17T22:15:03.178Z"},{"id":336757,"title":null,"review_text":"Very helpful content! I've done voiceover off and on for years and I'm only now starting professionally.  There were some solid tips I noted for the recording session, organizing my files, and exercises to warm up the voice and stay relaxed.  Thanks for a great course, Keith!","course_id":453127,"rating":5,"user_id":6480100,"approved":true,"created_at":"2020-07-18T11:44:51.745Z"},{"id":352865,"title":null,"review_text":"","course_id":453127,"rating":5,"user_id":27190218,"approved":true,"created_at":"2020-08-03T12:43:23.232Z"},{"id":353927,"title":null,"review_text":"I really enjoy this course, but I thought it was for Spanish Spoken  person.\r\nI mean at the beginning of the course, I could see the translation in Spanish, but later it was not possible, maybe I can´t do it correctly , but I can speak English and I understand it","course_id":453127,"rating":4,"user_id":26538549,"approved":true,"created_at":"2020-08-04T14:51:15.596Z"},{"id":355008,"title":null,"review_text":"This course was a great buy for the money! It feels very complete. I feel inspired to start getting jobs and WOW-ing clients!","course_id":453127,"rating":5,"user_id":26473328,"approved":true,"created_at":"2020-08-05T18:37:58.158Z"},{"id":358553,"title":null,"review_text":"Thanx! Even with a lot of experience myself i learned some new things! It's also a great way to remind yourself to keep learning. Thanx!","course_id":453127,"rating":5,"user_id":7588014,"approved":true,"created_at":"2020-08-09T19:37:15.778Z"},{"id":358858,"title":null,"review_text":"I think this course is helpful for a complete beginner and has some wonderful basics.  For a voiceover artist who has more experience under their belt, this might be a bit too simplistic.  Good visuals and great tips for those who are new to VO.","course_id":453127,"rating":5,"user_id":9748609,"approved":true,"created_at":"2020-08-10T03:26:15.304Z"},{"id":360449,"title":null,"review_text":"Always wanted to explore VO!\r\nI think this is a great course! i think i'll be back to review time and again! :)))","course_id":453127,"rating":5,"user_id":24604099,"approved":true,"created_at":"2020-08-11T06:39:05.228Z"},{"id":362838,"title":null,"review_text":"This was a really great and detailed course. It really included some nice tips even for people that are not new in the field. \r\nOne of the reasons I am not giving it a 5/5 stars is because I was really disappointed by the volume levels in this course. You are expecting a voice over course to have excellent sound. \r\nOverall great and thank you for all the tips and info! I really enjoyed it.","course_id":453127,"rating":4,"user_id":16732128,"approved":true,"created_at":"2020-08-13T18:40:03.541Z"},{"id":367498,"title":null,"review_text":"","course_id":453127,"rating":5,"user_id":27410380,"approved":true,"created_at":"2020-08-17T23:36:43.733Z"},{"id":370658,"title":null,"review_text":"Such great basic information. A real help for someone just starting out as a voice over artist on Fiverr!","course_id":453127,"rating":5,"user_id":27838743,"approved":true,"created_at":"2020-08-20T21:39:11.836Z"},{"id":381723,"title":null,"review_text":"I am a just coming up to the half way mark in this course. I'm super impressed and really glad that I have taken it. As someone just setting out in my voice over journey I have watched a lot of videos available out there on line as well as reading a pile of information on a variety of sites. This course make you feel like your one on one with Keith and his teaching style is excellent. I have already learned more about voice over with Keith's tips and lesson's then I have by doing my own research and practice. Well done Fiverr.","course_id":453127,"rating":5,"user_id":28549202,"approved":true,"created_at":"2020-08-30T15:30:30.518Z"},{"id":384646,"title":null,"review_text":"","course_id":453127,"rating":5,"user_id":5938672,"approved":true,"created_at":"2020-09-01T13:39:30.432Z"},{"id":384647,"title":null,"review_text":"Tons of very helpful useful information. ","course_id":453127,"rating":5,"user_id":28710702,"approved":true,"created_at":"2020-09-01T13:40:28.551Z"},{"id":392831,"title":null,"review_text":"","course_id":453127,"rating":5,"user_id":21387824,"approved":true,"created_at":"2020-09-06T22:23:12.481Z"},{"id":392878,"title":null,"review_text":"Learned so much from the course.I am an actress first and an engineer second.  It would be great if you recommend good technical help for hands on teaching to support the video.  And som parts I had to skip because I couldn't get the video to work.","course_id":453127,"rating":4,"user_id":27879353,"approved":true,"created_at":"2020-09-06T23:52:49.781Z"},{"id":394043,"title":null,"review_text":"","course_id":453127,"rating":5,"user_id":26477416,"approved":true,"created_at":"2020-09-07T16:14:51.895Z"},{"id":401327,"title":null,"review_text":"","course_id":453127,"rating":4,"user_id":29327923,"approved":true,"created_at":"2020-09-11T12:01:44.232Z"},{"id":405915,"title":null,"review_text":"","course_id":453127,"rating":5,"user_id":27049419,"approved":true,"created_at":"2020-09-14T13:24:33.746Z"},{"id":420058,"title":null,"review_text":"Keith is an excellent instructor and I would recommend this program to anyone starting out in the business. ","course_id":453127,"rating":5,"user_id":18780450,"approved":true,"created_at":"2020-09-22T23:12:53.174Z"},{"id":421953,"title":null,"review_text":"Very informative, easy to understand with clear delivery and a well structured course. A must for all new to voice over.","course_id":453127,"rating":5,"user_id":29893546,"approved":true,"created_at":"2020-09-24T07:49:41.637Z"},{"id":423171,"title":null,"review_text":"This course was easy to understand. There is a lot of information to digest but I believe that if I practice over time that I will get better every day. I look forward to landing my 1st gig with this information.","course_id":453127,"rating":5,"user_id":28717197,"approved":true,"created_at":"2020-09-24T23:52:02.900Z"},{"id":429134,"title":null,"review_text":"","course_id":453127,"rating":5,"user_id":29139061,"approved":true,"created_at":"2020-09-29T02:50:41.336Z"},{"id":443615,"title":null,"review_text":"","course_id":453127,"rating":5,"user_id":28662946,"approved":true,"created_at":"2020-10-11T10:07:28.045Z"},{"id":444974,"title":null,"review_text":"Some good information and useful ideas to explore, but it's clear that important parts of the course haven't been updated in some time, while others have been updated, but are not in line with other parts i.e. course materials referred to in the videos are not always where they should be, have been altered or are non-existent altogether.\r\n\r\nCriminally, audio levels are also inconsistent and had me reaching for the volume throughout, not only between videos, but within the videos themselves.  The case studies section is particularly guilty of this: Keith's samples were quite frankly obnoxiously loud in comparison to his slideshow voice over, or his pieces to camera.\r\n\r\nFinally, the section about including music seemed to result in a file that sent the VO to the left channel and music to the right.  Without further work, this is totally inappropriate and certainly not \"Complete\".\r\n\r\nAll in all, I would be disappointed if I'd paid full price for this, so I'm grateful for the 30% offer code.","course_id":453127,"rating":3,"user_id":9043156,"approved":true,"created_at":"2020-10-12T16:11:40.724Z"},{"id":447436,"title":null,"review_text":"Thanks, Keith. Good stuff. Would have preferred a little more Fiverr-centric info (i.e. how to maneuver a voice over career on Fiverr) but it's all good.","course_id":453127,"rating":5,"user_id":31029743,"approved":true,"created_at":"2020-10-14T16:15:02.986Z"},{"id":449475,"title":null,"review_text":"","course_id":453127,"rating":5,"user_id":28385590,"approved":true,"created_at":"2020-10-16T07:50:48.327Z"},{"id":449828,"title":null,"review_text":"Thanks, Keith! For brand-new voice-over artists, this is a great resource for all kinds of info needed to make it in this biz. And even for intermediates, there is still a thing or two new that you can pick up that can help you in your voice-over endeavors. I recommend that all VO people on Fiverr look into taking this course. Wishing huge success to you all!","course_id":453127,"rating":5,"user_id":12155500,"approved":true,"created_at":"2020-10-16T15:49:53.609Z"},{"id":453594,"title":null,"review_text":"","course_id":453127,"rating":5,"user_id":28444965,"approved":true,"created_at":"2020-10-20T04:42:46.149Z"},{"id":453950,"title":null,"review_text":"Excellent! Super! ","course_id":453127,"rating":5,"user_id":29770601,"approved":true,"created_at":"2020-10-20T13:34:18.836Z"},{"id":456558,"title":null,"review_text":"I've just finished to view the course and I can't be more satisfied. Keith is fantastic and his Guide is a must for everyone on Fiverr who works in the audio recording fields or wants to know about building a strong, energetic and healty long term career as self-employed here on Fiverr (or not). I really love the way he explores each section (so many!) and I think that this is a course that I will see again from time to time. It really inspires you to start and brings directly to your hands all the possibilities to do it. Following the course is like talking with Keith from the start to the end, he gives you tons of awesome tips without any hesitation. Love it: 5+!","course_id":453127,"rating":5,"user_id":7364187,"approved":true,"created_at":"2020-10-22T19:52:30.968Z"},{"id":462891,"title":null,"review_text":"I enjoyed this course. It was 2 hours plus but it felt pretty much less. Very informative but it was organized in such a relaxing and practical way that this made it fun. Cant wait to grow more. Highly recommended for new voice over freelancers. ","course_id":453127,"rating":5,"user_id":28717458,"approved":true,"created_at":"2020-10-28T19:34:25.631Z"},{"id":464212,"title":null,"review_text":"Great job giving detailed and practical instruction on what to expect and how to set yourself up for success pursuing a career in voiceover.  Thank you for taking the time to share your first-hand knowledge!","course_id":453127,"rating":5,"user_id":30761863,"approved":true,"created_at":"2020-10-29T21:27:03.605Z"},{"id":467318,"title":null,"review_text":"I enjoyed the course, it was informative and to the point.\r\nThank you,  Jedd Trice","course_id":453127,"rating":5,"user_id":31731966,"approved":true,"created_at":"2020-11-02T02:09:02.662Z"},{"id":473585,"title":null,"review_text":"Absolutely outstanding! Please take this course. ","course_id":453127,"rating":5,"user_id":32012100,"approved":true,"created_at":"2020-11-08T02:05:57.240Z"},{"id":475727,"title":null,"review_text":"Best of the best voice over course I've ever taken, it's very eye-opening to me. Keith went to details about characters in specific read. Which is something I struggle with, eventhough I have imitated several voice over artist, and lots of scripts to practice with really made me excited. Thanks a million, Keith :D","course_id":453127,"rating":5,"user_id":29846435,"approved":true,"created_at":"2020-11-10T03:10:37.338Z"},{"id":476612,"title":null,"review_text":"","course_id":453127,"rating":4,"user_id":29408937,"approved":true,"created_at":"2020-11-10T21:29:59.038Z"},{"id":483632,"title":null,"review_text":"really wonderful course I would absolutely recommend it!","course_id":453127,"rating":5,"user_id":8314273,"approved":true,"created_at":"2020-11-17T11:08:28.091Z"},{"id":490469,"title":null,"review_text":"Great course, I'm experienced with VO so I skipped a bit, but I definitely learned from this course and would recommend it to anyone selling VO on Fiverr.","course_id":453127,"rating":5,"user_id":12104993,"approved":true,"created_at":"2020-11-24T00:34:50.489Z"},{"id":495789,"title":null,"review_text":"Very informative! Everyone starting out needs to watch this coarse.  ","course_id":453127,"rating":5,"user_id":33167536,"approved":true,"created_at":"2020-11-29T14:36:48.092Z"},{"id":496413,"title":null,"review_text":"Quality information but I could find a lot of this info for free elsewhere.","course_id":453127,"rating":3,"user_id":15769627,"approved":true,"created_at":"2020-11-30T02:37:03.340Z"},{"id":497886,"title":null,"review_text":"","course_id":453127,"rating":5,"user_id":34507098,"approved":true,"created_at":"2020-12-01T06:10:08.682Z"},{"id":498770,"title":null,"review_text":"Keith was a pleasant and thorough teacher. It really feels like he cares about his craft, and helping others succeed. I highly recommend purchasing his services!","course_id":453127,"rating":5,"user_id":27450859,"approved":true,"created_at":"2020-12-01T22:40:55.906Z"},{"id":504994,"title":null,"review_text":"","course_id":453127,"rating":5,"user_id":34458344,"approved":true,"created_at":"2020-12-07T21:51:41.724Z"},{"id":516746,"title":null,"review_text":"","course_id":453127,"rating":5,"user_id":33726961,"approved":true,"created_at":"2020-12-20T01:23:06.095Z"},{"id":518472,"title":null,"review_text":"Keith Harris is providing very useful information in getting started in Voice Over.  It gives me confidence that this is something that I can work on and be successful with.","course_id":453127,"rating":5,"user_id":5751204,"approved":true,"created_at":"2020-12-21T23:57:11.332Z"},{"id":520741,"title":null,"review_text":"","course_id":453127,"rating":5,"user_id":35967386,"approved":true,"created_at":"2020-12-24T19:33:52.636Z"},{"id":520817,"title":null,"review_text":"Very informative!","course_id":453127,"rating":5,"user_id":12393544,"approved":true,"created_at":"2020-12-24T21:50:10.059Z"},{"id":524691,"title":null,"review_text":"Excellent information. Glad I got this course!","course_id":453127,"rating":5,"user_id":8255181,"approved":true,"created_at":"2020-12-29T16:18:57.697Z"},{"id":526344,"title":null,"review_text":"If you are an absolute novice to the voice over business, this course is definitely made for you. It covers all the basics you need to get started without being too complex and overwhelming.","course_id":453127,"rating":5,"user_id":31974306,"approved":true,"created_at":"2020-12-31T00:08:31.892Z"},{"id":526417,"title":null,"review_text":"Keith's course is excellent! He has a pleasant and upbeat attitude which makes him easy to listen to and the course is super thorough and packed with helpful information! Highly recommend!","course_id":453127,"rating":5,"user_id":24885959,"approved":true,"created_at":"2020-12-31T01:16:59.237Z"},{"id":532626,"title":null,"review_text":"Great stuff! I have done some v.o. work but this really filled in some of the gaps. Highly recommended for beginners and intermediate artists. Well worth the cost of admission!","course_id":453127,"rating":5,"user_id":31744633,"approved":true,"created_at":"2021-01-06T20:11:10.753Z"},{"id":534085,"title":null,"review_text":"Very informative. Soup to nuts, this course has it all. I enjoyed the attention paid to the surrounding aspects of pursuing gigs in voice over from the equipment that may be needed to considering your well being. This course was well worth the investment!","course_id":453127,"rating":5,"user_id":37052528,"approved":true,"created_at":"2021-01-08T07:16:24.783Z"},{"id":534090,"title":null,"review_text":"Although I'm already working in the Voice Over business for a bit, the course gave me a fresh, new input. It comprised various topics, what I really liked a lot. I would recommend the course for beginners, but not primarily for people that already work in this field. Keith did a great job, well done :)","course_id":453127,"rating":5,"user_id":28822500,"approved":true,"created_at":"2021-01-08T07:33:40.745Z"},{"id":535374,"title":null,"review_text":"Keith's course was excellent and very informative.  He successfully broke down a wealth of information in an easily digestible format. The various exercises and pro tips offered were well worth the price of this course. I highly recommend to anyone interested in pursuing a VO career. \r\n\r\nI admit that I was initially hesitant in making the investment due to a couple of negative reviews but the overall positive reviews far outweighed them and persuaded me to give it a go. I am so glad I did. Thank you Keith and thank you Fiverr for creating this course!","course_id":453127,"rating":5,"user_id":36232208,"approved":true,"created_at":"2021-01-09T19:44:38.554Z"},{"id":535439,"title":null,"review_text":"This the course for the beginner. If you've been doing voice over for sometime do not buy this. With that said though. The course goes through everything you need to get set up. He has a lot of tips, and tricks that will help you. He will help on preformance, editing, and being better with the business aspect. If you do purchase this course, and you know next to nothing, or just going into this with very little insight. Then this might just be the course for you!","course_id":453127,"rating":4,"user_id":36957956,"approved":true,"created_at":"2021-01-09T21:00:56.766Z"},{"id":539885,"title":null,"review_text":"I was very pleased with Keith's delivery and I just wish I had taken this course a year ago. Thank you so much.","course_id":453127,"rating":5,"user_id":5767365,"approved":true,"created_at":"2021-01-14T02:00:58.401Z"},{"id":543940,"title":null,"review_text":"Looking forward to starting this journey.  Appreciative for all aspects that this course covered.  From starting to succeeding! Would love to do an updated review one year from now as this was my first lengthy class with no prior experience.","course_id":453127,"rating":5,"user_id":37036419,"approved":true,"created_at":"2021-01-18T08:12:54.166Z"},{"id":545865,"title":null,"review_text":"Amazing. simple and clean to understand everything, and help me so much to chose which equipment i need to change. I recommend the course.","course_id":453127,"rating":5,"user_id":5761414,"approved":true,"created_at":"2021-01-20T04:09:03.561Z"},{"id":547609,"title":null,"review_text":"","course_id":453127,"rating":5,"user_id":38045333,"approved":true,"created_at":"2021-01-21T21:33:15.549Z"},{"id":549360,"title":null,"review_text":"Excellent presentation and phenomenal lessons!! 100/10 would go through this course again!","course_id":453127,"rating":5,"user_id":38259616,"approved":true,"created_at":"2021-01-24T03:05:25.033Z"},{"id":557125,"title":null,"review_text":"This is a great course for anybody in voice over, from absolute beginners to freelancers who have been in VO for awhile.  I've been studying VO and belong to other coaching groups, but I certainly did take away new information from Keith that I will use in my VO career.","course_id":453127,"rating":5,"user_id":26970253,"approved":true,"created_at":"2021-01-31T21:17:37.447Z"},{"id":560074,"title":null,"review_text":"Great and easy to follow course! \r\nWould love to have some more in-depth information about editing. But I enjoyed it and was well worth the money.  ","course_id":453127,"rating":4,"user_id":5965076,"approved":true,"created_at":"2021-02-03T15:57:27.503Z"},{"id":560182,"title":null,"review_text":"Even after 4 decades of VO experience, I found it to be an excellent refresher and as always, anytime you interact with other pros we learn and grow.","course_id":453127,"rating":5,"user_id":6459314,"approved":true,"created_at":"2021-02-03T17:50:27.117Z"},{"id":561057,"title":null,"review_text":"I very much enjoyed this class.  Hearing what Keith does as a VO professional and how he came to be in that space was a great reminder for why I like to do this kind of work.  It also gave me some practical information for the business of it, including vocal exercises, technical info for editing, and some nuts and bolts to track clients and the completed work.  Some reminders are also always helpful!","course_id":453127,"rating":4,"user_id":25219601,"approved":true,"created_at":"2021-02-04T15:57:21.173Z"},{"id":561765,"title":null,"review_text":"Very, very helpful! Thanks a lot!","course_id":453127,"rating":5,"user_id":37374767,"approved":true,"created_at":"2021-02-05T09:45:25.728Z"},{"id":562369,"title":null,"review_text":"Solid information on a lot of fronts. I've already been doing voice over for a while, but the course still gave me plenty of things to think about and explore!","course_id":453127,"rating":5,"user_id":9876462,"approved":true,"created_at":"2021-02-06T00:31:56.532Z"},{"id":567017,"title":null,"review_text":"Course is very informative but the questions throughout should be reviewed. At some point they all start saying incorrect, even though the correct answer is chosen.","course_id":453127,"rating":5,"user_id":39148115,"approved":true,"created_at":"2021-02-10T21:27:11.284Z"},{"id":569355,"title":null,"review_text":"","course_id":453127,"rating":5,"user_id":30347682,"approved":true,"created_at":"2021-02-13T13:07:47.193Z"}]