[{"id":438019,"title":null,"review_text":"A couple of spelling mistakes, the one that stood out most is using 'slut' instead of 'slug'.  Other than that, it was a great course that took a greenhorn like me to the next level of understanding it better.","course_id":923384,"rating":5,"user_id":25642323,"approved":true,"created_at":"2020-10-06T02:38:42.422Z","username":"brucew ."},{"id":462924,"title":null,"review_text":"Great course for optimizing the own Wordpress Page!","course_id":923384,"rating":5,"user_id":25418364,"approved":true,"created_at":"2020-10-28T20:09:20.445Z","username":"Maximilian Mende"},{"id":505409,"title":null,"review_text":"Good source of technical SEO insights.","course_id":923384,"rating":5,"user_id":14695924,"approved":true,"created_at":"2020-12-08T08:23:50.278Z","username":"Online Reputation Guru"},{"id":533277,"title":null,"review_text":"It's a good course to learn the best practices for technical WordPress SEO.","course_id":923384,"rating":5,"user_id":36862683,"approved":true,"created_at":"2021-01-07T14:03:16.873Z","username":"Zuhaib Zahid"},{"id":545984,"title":null,"review_text":"It's a well-structured course which sadly repeats the common mistake most online web development teachers tend to - I mean overestimating WordPress websites. \r\nAs the instructor shows and as I know from WordPress backend development, these kinds of installations have a deep folder density, which leads to slower websites and worse SEO. Unlike normal websites which are just coded with HTML5, CSS3, a JavaScript framework like jQuery, and PHP, browser crawlers need to dig through all the installation folders, subfolders like wp-content, and templates like single.php, functions.php, or simple page templates. \r\nJust because WordPress is an easy-to-use CMS, it doesn't mean it's good for SEO. To repeat me, the larger the website installation filesize sum, the worse your ranking might be and the poorer your website's performance as well.","course_id":923384,"rating":4,"user_id":9498902,"approved":true,"created_at":"2021-01-20T08:49:37.185Z","username":"Anna Stoermer"}]